<b>Write a program to read a number from user and find the square root, sin, tan, log and factorial of this number using math module.<b>

In [5]:
import math as m 
n = int(input('Number is:'))
print ('Square root:', m.sqrt(n))
print ('Sin:', m.sin(n))
print ('Tan:', m.tan(n))
print ('Factorial:', m.factorial(n))

Number is: 13

Square root: 3.605551275463989
Sin: 0.4201670368266409
Tan: 0.4630211329364896
Factorial: 6227020800

<b>Create a file named ‘temp.txt’ with some text present in it. Read this file and copy 
its contents in another file called ‘temp1.txt’ b  converting the text in upper case<b>.

In [1]:
with open("temp.txt", 'w') as f:
    f.write("Hello All\n")
    f.write("I am Anupama Thekkadavan\n")
    f.write("I am working on my assignment three of Python programming\n")
    f.write("Hope I am going in the correct direction\n")
    f.write("Good Bye\n")

In [2]:
f = open("temp.txt")
nf = open("temp1.txt", "w")
data = f.read()
nf.write(data.upper())
nf.close
f.close

In [3]:
nf = open("temp1.txt")
data = nf.readlines()
for line in data:
    print(line)

HELLO ALL

I AM ANUPAMA THEKKADAVAN

I AM WORKING ON MY ASSIGNMENT THREE OF PYTHON PROGRAMMING

HOPE I AM GOING IN THE CORRECT DIRECTION

GOOD BYE

<b>Write a Python class named ‘Rectangle’ with two attributes length and width and 
a method named ‘calculate’ which will compute the area of a rectangle. Create a 
object to pass length and width and call the method to calculate the area  f
rectang<b>le.

In [5]:
class Rectangle:
    def __init__(dim, l, b):
        dim.l = l
        dim.b = b
    def calculate(dim):
        c = dim.l*dim.b
        return c

ABCD = Rectangle(17.25, 82.75 )
print("Area of ABCD is", ABCD.calculate())

Area of ABCD is 1427.4375

<b>Download and read the file ‘cricket.csv’ from https://mitu.co.in/dataset and 
perform following operations on it.
1. Print the names of players
2. Find the names of players whose matches are greater than 100
3. Find information of the players whose name starts with ‘A’.
4. Convert all the names in upper-case and replace it with ori inal values.
5. Find the addition of all the runs.
6. Print the name of player with highest runs.

In [12]:
import pandas as pd
df = pd.read_csv('cricket.csv')
df

   sr.no           name  matches  runs  catches  wickets  stumpings
0      1    Anil Dalpat      122  6755       56       12          0
1      2   Rohan Kanhay      144  1256       76      178          0
2      3  Avdhoot Dighe      265  8954      120        0          0
3      4       Bahubali       10   756        6       11          3
4      5      Leeladhar      234  2866      105      376          0
5      6      Pradyumna      177  5877       47      122          0
6      7     Dinesh Roy      211  8537      112       16          0
7      8     Parmeshwar      245  9466       53        0          0
8      9    Ali Durrani       55  2756       12       26          0
9     10   Litesh Singh       89  1099       46       49          0

1. print names of the players

In [13]:
df ['name']

0      Anil Dalpat
1     Rohan Kanhay
2    Avdhoot Dighe
3         Bahubali
4        Leeladhar
5        Pradyumna
6       Dinesh Roy
7       Parmeshwar
8      Ali Durrani
9     Litesh Singh
Name: name, dtype: object

2. Names of the players whose matches are greater than 100

In [15]:
n = df [df['matches'] > 100]
n[['name', 'matches']]

            name  matches
0    Anil Dalpat      122
1   Rohan Kanhay      144
2  Avdhoot Dighe      265
4      Leeladhar      234
5      Pradyumna      177
6     Dinesh Roy      211
7     Parmeshwar      245

3. Information on players whose name starts with 'A'

In [16]:
p = df[df['name'].str.startswith('A')]
p

   sr.no           name  matches  runs  catches  wickets  stumpings
0      1    Anil Dalpat      122  6755       56       12          0
2      3  Avdhoot Dighe      265  8954      120        0          0
8      9    Ali Durrani       55  2756       12       26          0

4. Convert all names to upper case and replacing the original values with it

In [18]:
df['name'] = df['name'].str.upper()
df

   sr.no           name  matches  runs  catches  wickets  stumpings
0      1    ANIL DALPAT      122  6755       56       12          0
1      2   ROHAN KANHAY      144  1256       76      178          0
2      3  AVDHOOT DIGHE      265  8954      120        0          0
3      4       BAHUBALI       10   756        6       11          3
4      5      LEELADHAR      234  2866      105      376          0
5      6      PRADYUMNA      177  5877       47      122          0
6      7     DINESH ROY      211  8537      112       16          0
7      8     PARMESHWAR      245  9466       53        0          0
8      9    ALI DURRANI       55  2756       12       26          0
9     10   LITESH SINGH       89  1099       46       49          0

5. Sum of runs

In [19]:
df['runs'].sum()

48322

6. Print name of player with highest runs

In [20]:
x = df[df['runs'] == df['runs'].max()]
x[['name', 'runs']]

         name  runs
7  PARMESHWAR  9466